''' 2. Сформувати функцію для обчислення цифрового кореню натурального числа.
Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
числа.Рекурсивний метод'''
import timeit
def sum(x):
    if x<=9:#Створення рекурсивної функції для сумування цифр
        return x
    else:
        return sum(x//10)+x%10
def sqrt(x):
    if x<=9:#Створення рекурсивної функції для перевірки чи є дана сума однозначним числом
        return x
    else:
        return sqrt(sum(x))
n=int(input('Enter your num: '))
print(f'Your new num:{sqrt(n)}')
t = timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print(f'Program worked {t} seconds')

'''Час написання близько 15-20 хвилин,оскільки досить тяжко знайти алгоритм для схожої задачі не використовуючи ітерації'''