''' 2. Сформувати функцію для обчислення цифрового кореню натурального числа.
Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
числа.Ітераційний метод'''
import timeit
def sum(x):#Створення функції для обрахування суми
    k=0
    if x<=9:
        return x
    else:
       while x>10:
           k += x % 10
           x //= 10
           x+=k
       return x
n=int(input('Enter your num:'))
print(f'Your new noun:{sum(n)}')
t = timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)
print(f'Program worked {t} seconds')

'''Написання програми зайняло близько 5 хвилин,оскільки ітераційний метод більш доцільний у цьому випадку через читабельність коду'''



